app/controllers/profiles_controller.rb

DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 1]]
---
	def destroy

	  @profile = Profile.find(params[:id])
	  @profile.destroy