app/controllers/profiles_controller.rb

  def index
    self.authenticate
    @profiles = Profile.where(active: true)
    @profiles.order("created_at")
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."active" = $1  [["active", true]]
SELECT "profiles".* FROM "profiles" ORDER BY created_at

    category = category.join(", ")

    @profile = Profile.new(profile_params.merge(start_date_current: start_date, start_date_pe: start_date_pe, category: category))
    if @profile.save
---
INSERT INTO "profiles" ("first_name", "last_name", "university", "graduation_year", "company", "current_location", "gender", "start_date_current", "start_date_pe", "industry_preference_first", "industry_preference_second", "industry_preference_third", "created_at", "updated_at", "resume_file_name", "resume_content_type", "resume_file_size", "resume_updated_at", "region", "occupation", "category") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"

  def show
    profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def update
    @profile = Profile.find(params[:id].to_i)
    @profile.update_attributes(profile_params)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "profiles" SET "first_name" = $1, "company" = $2, "current_location" = $3, "region" = $4, "gender" = $5, "start_date_pe" = $6, "updated_at" = $7 WHERE "profiles"."id" = $8

  def destroy
    @profile = Profile.find(params[:id])
    @profile.active = false
    @profile.save
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "active" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["active", false], ["updated_at", 2016-12-15 23:18:15 UTC], ["id", 10]]

  def download_all
    @profiles = Profile.order(params["order"])
---
SELECT "profiles".* FROM "profiles" ORDER BY graduation_year

  def download_selected
    profile_id = params["data"]
    order = params["order"]
    selected_profile = []

    profile_id.each do |id|
      profile = Profile.find(id.to_i)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def destroy_selected
    profile_id = params["data"]

    if profile_id

      selected_profile = []

      profile_id.each do |id|
        profile = Profile.find(id.to_i)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]